_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 62, 62, 8)         224       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 60, 60, 16)        1168      
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 58, 58, 32)        4640      
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 29, 29, 32)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 29, 29, 32)        128       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 27, 27, 32)        9248      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 25, 25, 64)        18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 12, 12, 64)        256       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 10, 10, 48)        27696     
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 8, 8, 96)          41568     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 96)          0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 4, 4, 96)          384       
_________________________________________________________________
flatten_1 (Flatten)          (None, 1536)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               196736    
_________________________________________________________________
dense_2 (Dense)              (None, 256)               33024     
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 257       
=================================================================
Total params: 333,825
Trainable params: 333,441
Non-trainable params: 384
_________________________________________________________________
